; domain
(define
	(domain sokoban)
	(:requirements :adl)
	(:predicates
		(poziomo ?poz1 ?poz2)
		(pionowo ?poz1 ?poz2)
		(paczka ?poz)
		(robot ?poz)
		(cel ?poz)
	)
	; przejdz na inna pozycje
	(:action idz
		:parameters (?poz1 ?poz2)
		:precondition
		(and
			(robot ?poz1)
			(not (paczka ?poz2))
			(or (poziomo ?poz1 ?poz2) (pionowo ?poz1 ?poz2))
		)
		:effect
		(and
			(robot ?poz2)
			(not (robot ?poz1))
		)
	)
	(:action pchaj
		:parameters (?pozRobota ?staraPozPaczki ?nowaPozPaczki)
		:precondition
		(and
			(not (= ?pozRobota ?nowaPozPaczki))
			(robot ?pozRobota)
			(paczka ?staraPozPaczki)
			(not (paczka ?nowaPozPaczki))
			(or
				(and (poziomo ?pozRobota ?staraPozPaczki) (poziomo ?staraPozPaczki ?nowaPozPaczki))
				(and (pionowo ?pozRobota ?staraPozPaczki) (pionowo ?staraPozPaczki ?nowaPozPaczki))
			)
		)
		:effect
		(and
			(robot ?staraPozPaczki)
			(paczka ?nowaPozPaczki)
			(not (robot ?pozRobota))
			(not (paczka ?staraPozPaczki))	
		)
	)	
)

; problem
(define (problem gsoko1a)
(:domain sokoban)
(:objects f_2_8 f_2_9 f_3_8 f_3_9 f_4_6 f_4_7 f_4_8 f_4_9 f_5_6 f_5_9 f_6_3 f_6_4 f_6_5 f_6_6 f_6_7 f_6_8 f_6_9 f_6_10 f_6_11 f_7_3 f_7_4 f_7_5 f_7_6 f_7_9 f_7_11 f_8_3 f_8_4 f_8_5 f_8_6 f_8_9 f_8_11 f_9_6 f_9_7 f_9_8 f_9_9 f_9_11 f_10_9 f_10_10 f_10_11 f_11_9 f_12_9 f_12_10 f_13_9 f_14_9 f_15_8 f_15_9 f_15_10 f_16_8 f_16_9 f_16_10 f_17_8 f_17_9 f_17_10 f_18_8 f_18_9 f_18_10 )
(:init
(poziomo f_2_8 f_3_8)
(poziomo f_3_8 f_2_8)
(pionowo f_2_8 f_2_9)
(pionowo f_2_9 f_2_8)
(poziomo f_2_9 f_3_9)
(poziomo f_3_9 f_2_9)
(poziomo f_3_8 f_4_8)
(poziomo f_4_8 f_3_8)
(pionowo f_3_8 f_3_9)
(pionowo f_3_9 f_3_8)
(poziomo f_3_9 f_4_9)
(poziomo f_4_9 f_3_9)
(paczka f_3_9)
(poziomo f_4_6 f_5_6)
(poziomo f_5_6 f_4_6)
(pionowo f_4_6 f_4_7)
(pionowo f_4_7 f_4_6)
(pionowo f_4_7 f_4_8)
(pionowo f_4_8 f_4_7)
(pionowo f_4_8 f_4_9)
(pionowo f_4_9 f_4_8)
(poziomo f_4_9 f_5_9)
(poziomo f_5_9 f_4_9)
(poziomo f_5_6 f_6_6)
(poziomo f_6_6 f_5_6)
(poziomo f_5_9 f_6_9)
(poziomo f_6_9 f_5_9)
(poziomo f_6_3 f_7_3)
(poziomo f_7_3 f_6_3)
(pionowo f_6_3 f_6_4)
(pionowo f_6_4 f_6_3)
(poziomo f_6_4 f_7_4)
(poziomo f_7_4 f_6_4)
(pionowo f_6_4 f_6_5)
(pionowo f_6_5 f_6_4)
(poziomo f_6_5 f_7_5)
(poziomo f_7_5 f_6_5)
(pionowo f_6_5 f_6_6)
(pionowo f_6_6 f_6_5)
(poziomo f_6_6 f_7_6)
(poziomo f_7_6 f_6_6)
(pionowo f_6_6 f_6_7)
(pionowo f_6_7 f_6_6)
(paczka f_6_6)
(pionowo f_6_7 f_6_8)
(pionowo f_6_8 f_6_7)
(pionowo f_6_8 f_6_9)
(pionowo f_6_9 f_6_8)
(poziomo f_6_9 f_7_9)
(poziomo f_7_9 f_6_9)
(pionowo f_6_9 f_6_10)
(pionowo f_6_10 f_6_9)
(paczka f_6_9)
(pionowo f_6_10 f_6_11)
(pionowo f_6_11 f_6_10)
(poziomo f_6_11 f_7_11)
(poziomo f_7_11 f_6_11)
(poziomo f_7_3 f_8_3)
(poziomo f_8_3 f_7_3)
(pionowo f_7_3 f_7_4)
(pionowo f_7_4 f_7_3)
(poziomo f_7_4 f_8_4)
(poziomo f_8_4 f_7_4)
(pionowo f_7_4 f_7_5)
(pionowo f_7_5 f_7_4)
(poziomo f_7_5 f_8_5)
(poziomo f_8_5 f_7_5)
(pionowo f_7_5 f_7_6)
(pionowo f_7_6 f_7_5)
(poziomo f_7_6 f_8_6)
(poziomo f_8_6 f_7_6)
(poziomo f_7_9 f_8_9)
(poziomo f_8_9 f_7_9)
(poziomo f_7_11 f_8_11)
(poziomo f_8_11 f_7_11)
(pionowo f_8_3 f_8_4)
(pionowo f_8_4 f_8_3)
(pionowo f_8_4 f_8_5)
(pionowo f_8_5 f_8_4)
(pionowo f_8_5 f_8_6)
(pionowo f_8_6 f_8_5)
(poziomo f_8_6 f_9_6)
(poziomo f_9_6 f_8_6)
(poziomo f_8_9 f_9_9)
(poziomo f_9_9 f_8_9)
(poziomo f_8_11 f_9_11)
(poziomo f_9_11 f_8_11)
(pionowo f_9_6 f_9_7)
(pionowo f_9_7 f_9_6)
(pionowo f_9_7 f_9_8)
(pionowo f_9_8 f_9_7)
(pionowo f_9_8 f_9_9)
(pionowo f_9_9 f_9_8)
(poziomo f_9_9 f_10_9)
(poziomo f_10_9 f_9_9)
(poziomo f_9_11 f_10_11)
(poziomo f_10_11 f_9_11)
(poziomo f_10_9 f_11_9)
(poziomo f_11_9 f_10_9)
(pionowo f_10_9 f_10_10)
(pionowo f_10_10 f_10_9)
(pionowo f_10_10 f_10_11)
(pionowo f_10_11 f_10_10)
(poziomo f_11_9 f_12_9)
(poziomo f_12_9 f_11_9)
(poziomo f_12_9 f_13_9)
(poziomo f_13_9 f_12_9)
(pionowo f_12_9 f_12_10)
(pionowo f_12_10 f_12_9)
(robot f_12_10)
(poziomo f_13_9 f_14_9)
(poziomo f_14_9 f_13_9)
(poziomo f_14_9 f_15_9)
(poziomo f_15_9 f_14_9)
(poziomo f_15_8 f_16_8)
(poziomo f_16_8 f_15_8)
(pionowo f_15_8 f_15_9)
(pionowo f_15_9 f_15_8)
(poziomo f_15_9 f_16_9)
(poziomo f_16_9 f_15_9)
(pionowo f_15_9 f_15_10)
(pionowo f_15_10 f_15_9)
(poziomo f_15_10 f_16_10)
(poziomo f_16_10 f_15_10)
(poziomo f_16_8 f_17_8)
(poziomo f_17_8 f_16_8)
(pionowo f_16_8 f_16_9)
(pionowo f_16_9 f_16_8)
(poziomo f_16_9 f_17_9)
(poziomo f_17_9 f_16_9)
(pionowo f_16_9 f_16_10)
(pionowo f_16_10 f_16_9)
(poziomo f_16_10 f_17_10)
(poziomo f_17_10 f_16_10)
(poziomo f_17_8 f_18_8)
(poziomo f_18_8 f_17_8)
(pionowo f_17_8 f_17_9)
(pionowo f_17_9 f_17_8)
(cel f_17_8)
(paczka f_17_8)
(poziomo f_17_9 f_18_9)
(poziomo f_18_9 f_17_9)
(pionowo f_17_9 f_17_10)
(pionowo f_17_10 f_17_9)
(cel f_17_9)
(paczka f_17_9)
(poziomo f_17_10 f_18_10)
(poziomo f_18_10 f_17_10)
(cel f_17_10)
(paczka f_17_10)
(pionowo f_18_8 f_18_9)
(pionowo f_18_9 f_18_8)
(cel f_18_8)
(pionowo f_18_9 f_18_10)
(pionowo f_18_10 f_18_9)
(cel f_18_9)
(cel f_18_10)
)
(:goal (and
(paczka f_17_8)
(paczka f_17_9)
(paczka f_17_10)
(paczka f_18_8)
(paczka f_18_9)
(paczka f_18_10)
))
)

; plan
1. (idz f_12_10 f_12_9)
   deleted: (robot f_12_10)
   added: (robot f_12_9)
   goals met: 3 of 6
2. (idz f_12_9 f_11_9)
   deleted: (robot f_12_9)
   added: (robot f_11_9)
   goals met: 3 of 6
3. (idz f_11_9 f_10_9)
   deleted: (robot f_11_9)
   added: (robot f_10_9)
   goals met: 3 of 6
4. (idz f_10_9 f_9_9)
   deleted: (robot f_10_9)
   added: (robot f_9_9)
   goals met: 3 of 6
5. (idz f_9_9 f_9_8)
   deleted: (robot f_9_9)
   added: (robot f_9_8)
   goals met: 3 of 6
6. (idz f_9_8 f_9_7)
   deleted: (robot f_9_8)
   added: (robot f_9_7)
   goals met: 3 of 6
7. (idz f_9_7 f_9_6)
   deleted: (robot f_9_7)
   added: (robot f_9_6)
   goals met: 3 of 6
8. (idz f_9_6 f_8_6)
   deleted: (robot f_9_6)
   added: (robot f_8_6)
   goals met: 3 of 6
9. (idz f_8_6 f_7_6)
   deleted: (robot f_8_6)
   added: (robot f_7_6)
   goals met: 3 of 6
10. (idz f_7_6 f_7_5)
   deleted: (robot f_7_6)
   added: (robot f_7_5)
   goals met: 3 of 6
11. (idz f_7_5 f_6_5)
   deleted: (robot f_7_5)
   added: (robot f_6_5)
   goals met: 3 of 6
12. (pchaj f_6_5 f_6_6 f_6_7)
   deleted: (robot f_6_5) (paczka f_6_6)
   added: (robot f_6_6) (paczka f_6_7)
   goals met: 3 of 6
13. (idz f_6_6 f_5_6)
   deleted: (robot f_6_6)
   added: (robot f_5_6)
   goals met: 3 of 6
14. (idz f_5_6 f_4_6)
   deleted: (robot f_5_6)
   added: (robot f_4_6)
   goals met: 3 of 6
15. (idz f_4_6 f_4_7)
   deleted: (robot f_4_6)
   added: (robot f_4_7)
   goals met: 3 of 6
16. (idz f_4_7 f_4_8)
   deleted: (robot f_4_7)
   added: (robot f_4_8)
   goals met: 3 of 6
17. (idz f_4_8 f_4_9)
   deleted: (robot f_4_8)
   added: (robot f_4_9)
   goals met: 3 of 6
18. (idz f_4_9 f_5_9)
   deleted: (robot f_4_9)
   added: (robot f_5_9)
   goals met: 3 of 6
19. (pchaj f_5_9 f_6_9 f_7_9)
   deleted: (robot f_5_9) (paczka f_6_9)
   added: (robot f_6_9) (paczka f_7_9)
   goals met: 3 of 6
20. (pchaj f_6_9 f_7_9 f_8_9)
   deleted: (robot f_6_9) (paczka f_7_9)
   added: (robot f_7_9) (paczka f_8_9)
   goals met: 3 of 6
21. (pchaj f_7_9 f_8_9 f_9_9)
   deleted: (robot f_7_9) (paczka f_8_9)
   added: (robot f_8_9) (paczka f_9_9)
   goals met: 3 of 6
22. (pchaj f_8_9 f_9_9 f_10_9)
   deleted: (robot f_8_9) (paczka f_9_9)
   added: (robot f_9_9) (paczka f_10_9)
   goals met: 3 of 6
23. (pchaj f_9_9 f_10_9 f_11_9)
   deleted: (robot f_9_9) (paczka f_10_9)
   added: (robot f_10_9) (paczka f_11_9)
   goals met: 3 of 6
24. (pchaj f_10_9 f_11_9 f_12_9)
   deleted: (robot f_10_9) (paczka f_11_9)
   added: (robot f_11_9) (paczka f_12_9)
   goals met: 3 of 6
25. (pchaj f_11_9 f_12_9 f_13_9)
   deleted: (robot f_11_9) (paczka f_12_9)
   added: (robot f_12_9) (paczka f_13_9)
   goals met: 3 of 6
26. (pchaj f_12_9 f_13_9 f_14_9)
   deleted: (robot f_12_9) (paczka f_13_9)
   added: (robot f_13_9) (paczka f_14_9)
   goals met: 3 of 6
27. (pchaj f_13_9 f_14_9 f_15_9)
   deleted: (robot f_13_9) (paczka f_14_9)
   added: (robot f_14_9) (paczka f_15_9)
   goals met: 3 of 6
28. (pchaj f_14_9 f_15_9 f_16_9)
   deleted: (robot f_14_9) (paczka f_15_9)
   added: (robot f_15_9) (paczka f_16_9)
   goals met: 3 of 6
29. (idz f_15_9 f_15_10)
   deleted: (robot f_15_9)
   added: (robot f_15_10)
   goals met: 3 of 6
30. (idz f_15_10 f_16_10)
   deleted: (robot f_15_10)
   added: (robot f_16_10)
   goals met: 3 of 6
31. (pchaj f_16_10 f_17_10 f_18_10)
   deleted: (robot f_16_10) (paczka f_17_10)
   added: (robot f_17_10) (paczka f_18_10)
   goals met: 3 of 6
32. (idz f_17_10 f_16_10)
   deleted: (robot f_17_10)
   added: (robot f_16_10)
   goals met: 3 of 6
33. (idz f_16_10 f_15_10)
   deleted: (robot f_16_10)
   added: (robot f_15_10)
   goals met: 3 of 6
34. (idz f_15_10 f_15_9)
   deleted: (robot f_15_10)
   added: (robot f_15_9)
   goals met: 3 of 6
35. (idz f_15_9 f_15_8)
   deleted: (robot f_15_9)
   added: (robot f_15_8)
   goals met: 3 of 6
36. (idz f_15_8 f_16_8)
   deleted: (robot f_15_8)
   added: (robot f_16_8)
   goals met: 3 of 6
37. (pchaj f_16_8 f_17_8 f_18_8)
   deleted: (robot f_16_8) (paczka f_17_8)
   added: (robot f_17_8) (paczka f_18_8)
   goals met: 3 of 6
38. (idz f_17_8 f_16_8)
   deleted: (robot f_17_8)
   added: (robot f_16_8)
   goals met: 3 of 6
39. (pchaj f_16_8 f_16_9 f_16_10)
   deleted: (robot f_16_8) (paczka f_16_9)
   added: (robot f_16_9) (paczka f_16_10)
   goals met: 3 of 6
40. (idz f_16_9 f_15_9)
   deleted: (robot f_16_9)
   added: (robot f_15_9)
   goals met: 3 of 6
41. (idz f_15_9 f_14_9)
   deleted: (robot f_15_9)
   added: (robot f_14_9)
   goals met: 3 of 6
42. (idz f_14_9 f_13_9)
   deleted: (robot f_14_9)
   added: (robot f_13_9)
   goals met: 3 of 6
43. (idz f_13_9 f_12_9)
   deleted: (robot f_13_9)
   added: (robot f_12_9)
   goals met: 3 of 6
44. (idz f_12_9 f_11_9)
   deleted: (robot f_12_9)
   added: (robot f_11_9)
   goals met: 3 of 6
45. (idz f_11_9 f_10_9)
   deleted: (robot f_11_9)
   added: (robot f_10_9)
   goals met: 3 of 6
46. (idz f_10_9 f_9_9)
   deleted: (robot f_10_9)
   added: (robot f_9_9)
   goals met: 3 of 6
47. (idz f_9_9 f_8_9)
   deleted: (robot f_9_9)
   added: (robot f_8_9)
   goals met: 3 of 6
48. (idz f_8_9 f_7_9)
   deleted: (robot f_8_9)
   added: (robot f_7_9)
   goals met: 3 of 6
49. (idz f_7_9 f_6_9)
   deleted: (robot f_7_9)
   added: (robot f_6_9)
   goals met: 3 of 6
50. (idz f_6_9 f_5_9)
   deleted: (robot f_6_9)
   added: (robot f_5_9)
   goals met: 3 of 6
51. (idz f_5_9 f_4_9)
   deleted: (robot f_5_9)
   added: (robot f_4_9)
   goals met: 3 of 6
52. (idz f_4_9 f_4_8)
   deleted: (robot f_4_9)
   added: (robot f_4_8)
   goals met: 3 of 6
53. (idz f_4_8 f_3_8)
   deleted: (robot f_4_8)
   added: (robot f_3_8)
   goals met: 3 of 6
54. (idz f_3_8 f_2_8)
   deleted: (robot f_3_8)
   added: (robot f_2_8)
   goals met: 3 of 6
55. (idz f_2_8 f_2_9)
   deleted: (robot f_2_8)
   added: (robot f_2_9)
   goals met: 3 of 6
56. (pchaj f_2_9 f_3_9 f_4_9)
   deleted: (robot f_2_9) (paczka f_3_9)
   added: (robot f_3_9) (paczka f_4_9)
   goals met: 3 of 6
57. (pchaj f_3_9 f_4_9 f_5_9)
   deleted: (robot f_3_9) (paczka f_4_9)
   added: (robot f_4_9) (paczka f_5_9)
   goals met: 3 of 6
58. (pchaj f_4_9 f_5_9 f_6_9)
   deleted: (robot f_4_9) (paczka f_5_9)
   added: (robot f_5_9) (paczka f_6_9)
   goals met: 3 of 6
59. (pchaj f_5_9 f_6_9 f_7_9)
   deleted: (robot f_5_9) (paczka f_6_9)
   added: (robot f_6_9) (paczka f_7_9)
   goals met: 3 of 6
60. (pchaj f_6_9 f_7_9 f_8_9)
   deleted: (robot f_6_9) (paczka f_7_9)
   added: (robot f_7_9) (paczka f_8_9)
   goals met: 3 of 6
61. (pchaj f_7_9 f_8_9 f_9_9)
   deleted: (robot f_7_9) (paczka f_8_9)
   added: (robot f_8_9) (paczka f_9_9)
   goals met: 3 of 6
62. (pchaj f_8_9 f_9_9 f_10_9)
   deleted: (robot f_8_9) (paczka f_9_9)
   added: (robot f_9_9) (paczka f_10_9)
   goals met: 3 of 6
63. (pchaj f_9_9 f_10_9 f_11_9)
   deleted: (robot f_9_9) (paczka f_10_9)
   added: (robot f_10_9) (paczka f_11_9)
   goals met: 3 of 6
64. (pchaj f_10_9 f_11_9 f_12_9)
   deleted: (robot f_10_9) (paczka f_11_9)
   added: (robot f_11_9) (paczka f_12_9)
   goals met: 3 of 6
65. (pchaj f_11_9 f_12_9 f_13_9)
   deleted: (robot f_11_9) (paczka f_12_9)
   added: (robot f_12_9) (paczka f_13_9)
   goals met: 3 of 6
66. (pchaj f_12_9 f_13_9 f_14_9)
   deleted: (robot f_12_9) (paczka f_13_9)
   added: (robot f_13_9) (paczka f_14_9)
   goals met: 3 of 6
67. (pchaj f_13_9 f_14_9 f_15_9)
   deleted: (robot f_13_9) (paczka f_14_9)
   added: (robot f_14_9) (paczka f_15_9)
   goals met: 3 of 6
68. (pchaj f_14_9 f_15_9 f_16_9)
   deleted: (robot f_14_9) (paczka f_15_9)
   added: (robot f_15_9) (paczka f_16_9)
   goals met: 3 of 6
69. (idz f_15_9 f_15_10)
   deleted: (robot f_15_9)
   added: (robot f_15_10)
   goals met: 3 of 6
70. (pchaj f_15_10 f_16_10 f_17_10)
   deleted: (robot f_15_10) (paczka f_16_10)
   added: (robot f_16_10) (paczka f_17_10)
   goals met: 4 of 6
71. (pchaj f_16_10 f_16_9 f_16_8)
   deleted: (robot f_16_10) (paczka f_16_9)
   added: (robot f_16_9) (paczka f_16_8)
   goals met: 4 of 6
72. (pchaj f_16_9 f_17_9 f_18_9)
   deleted: (robot f_16_9) (paczka f_17_9)
   added: (robot f_17_9) (paczka f_18_9)
   goals met: 4 of 6
73. (idz f_17_9 f_16_9)
   deleted: (robot f_17_9)
   added: (robot f_16_9)
   goals met: 4 of 6
74. (idz f_16_9 f_15_9)
   deleted: (robot f_16_9)
   added: (robot f_15_9)
   goals met: 4 of 6
75. (idz f_15_9 f_14_9)
   deleted: (robot f_15_9)
   added: (robot f_14_9)
   goals met: 4 of 6
76. (idz f_14_9 f_13_9)
   deleted: (robot f_14_9)
   added: (robot f_13_9)
   goals met: 4 of 6
77. (idz f_13_9 f_12_9)
   deleted: (robot f_13_9)
   added: (robot f_12_9)
   goals met: 4 of 6
78. (idz f_12_9 f_11_9)
   deleted: (robot f_12_9)
   added: (robot f_11_9)
   goals met: 4 of 6
79. (idz f_11_9 f_10_9)
   deleted: (robot f_11_9)
   added: (robot f_10_9)
   goals met: 4 of 6
80. (idz f_10_9 f_9_9)
   deleted: (robot f_10_9)
   added: (robot f_9_9)
   goals met: 4 of 6
81. (idz f_9_9 f_9_8)
   deleted: (robot f_9_9)
   added: (robot f_9_8)
   goals met: 4 of 6
82. (idz f_9_8 f_9_7)
   deleted: (robot f_9_8)
   added: (robot f_9_7)
   goals met: 4 of 6
83. (idz f_9_7 f_9_6)
   deleted: (robot f_9_7)
   added: (robot f_9_6)
   goals met: 4 of 6
84. (idz f_9_6 f_8_6)
   deleted: (robot f_9_6)
   added: (robot f_8_6)
   goals met: 4 of 6
85. (idz f_8_6 f_7_6)
   deleted: (robot f_8_6)
   added: (robot f_7_6)
   goals met: 4 of 6
86. (idz f_7_6 f_6_6)
   deleted: (robot f_7_6)
   added: (robot f_6_6)
   goals met: 4 of 6
87. (pchaj f_6_6 f_6_7 f_6_8)
   deleted: (robot f_6_6) (paczka f_6_7)
   added: (robot f_6_7) (paczka f_6_8)
   goals met: 4 of 6
88. (pchaj f_6_7 f_6_8 f_6_9)
   deleted: (robot f_6_7) (paczka f_6_8)
   added: (robot f_6_8) (paczka f_6_9)
   goals met: 4 of 6
89. (idz f_6_8 f_6_7)
   deleted: (robot f_6_8)
   added: (robot f_6_7)
   goals met: 4 of 6
90. (idz f_6_7 f_6_6)
   deleted: (robot f_6_7)
   added: (robot f_6_6)
   goals met: 4 of 6
91. (idz f_6_6 f_5_6)
   deleted: (robot f_6_6)
   added: (robot f_5_6)
   goals met: 4 of 6
92. (idz f_5_6 f_4_6)
   deleted: (robot f_5_6)
   added: (robot f_4_6)
   goals met: 4 of 6
93. (idz f_4_6 f_4_7)
   deleted: (robot f_4_6)
   added: (robot f_4_7)
   goals met: 4 of 6
94. (idz f_4_7 f_4_8)
   deleted: (robot f_4_7)
   added: (robot f_4_8)
   goals met: 4 of 6
95. (idz f_4_8 f_4_9)
   deleted: (robot f_4_8)
   added: (robot f_4_9)
   goals met: 4 of 6
96. (idz f_4_9 f_5_9)
   deleted: (robot f_4_9)
   added: (robot f_5_9)
   goals met: 4 of 6
97. (pchaj f_5_9 f_6_9 f_7_9)
   deleted: (robot f_5_9) (paczka f_6_9)
   added: (robot f_6_9) (paczka f_7_9)
   goals met: 4 of 6
98. (pchaj f_6_9 f_7_9 f_8_9)
   deleted: (robot f_6_9) (paczka f_7_9)
   added: (robot f_7_9) (paczka f_8_9)
   goals met: 4 of 6
99. (pchaj f_7_9 f_8_9 f_9_9)
   deleted: (robot f_7_9) (paczka f_8_9)
   added: (robot f_8_9) (paczka f_9_9)
   goals met: 4 of 6
100. (pchaj f_8_9 f_9_9 f_10_9)
   deleted: (robot f_8_9) (paczka f_9_9)
   added: (robot f_9_9) (paczka f_10_9)
   goals met: 4 of 6
101. (pchaj f_9_9 f_10_9 f_11_9)
   deleted: (robot f_9_9) (paczka f_10_9)
   added: (robot f_10_9) (paczka f_11_9)
   goals met: 4 of 6
102. (pchaj f_10_9 f_11_9 f_12_9)
   deleted: (robot f_10_9) (paczka f_11_9)
   added: (robot f_11_9) (paczka f_12_9)
   goals met: 4 of 6
103. (pchaj f_11_9 f_12_9 f_13_9)
   deleted: (robot f_11_9) (paczka f_12_9)
   added: (robot f_12_9) (paczka f_13_9)
   goals met: 4 of 6
104. (pchaj f_12_9 f_13_9 f_14_9)
   deleted: (robot f_12_9) (paczka f_13_9)
   added: (robot f_13_9) (paczka f_14_9)
   goals met: 4 of 6
105. (pchaj f_13_9 f_14_9 f_15_9)
   deleted: (robot f_13_9) (paczka f_14_9)
   added: (robot f_14_9) (paczka f_15_9)
   goals met: 4 of 6
106. (pchaj f_14_9 f_15_9 f_16_9)
   deleted: (robot f_14_9) (paczka f_15_9)
   added: (robot f_15_9) (paczka f_16_9)
   goals met: 4 of 6
107. (pchaj f_15_9 f_16_9 f_17_9)
   deleted: (robot f_15_9) (paczka f_16_9)
   added: (robot f_16_9) (paczka f_17_9)
   goals met: 5 of 6
108. (idz f_16_9 f_15_9)
   deleted: (robot f_16_9)
   added: (robot f_15_9)
   goals met: 5 of 6
109. (idz f_15_9 f_15_8)
   deleted: (robot f_15_9)
   added: (robot f_15_8)
   goals met: 5 of 6
110. (pchaj f_15_8 f_16_8 f_17_8)
   deleted: (robot f_15_8) (paczka f_16_8)
   added: (robot f_16_8) (paczka f_17_8)
   goals met: 6 of 6
